import AboBakr from "../Assets/Reciters/AboBakr.webp";
import AhmedAgamy from "../Assets/Reciters/AhmedAgamy.webp";
import Ali from "../Assets/Reciters/Ali.webp";
import Besfer from "../Assets/Reciters/Besfer.webp";
import HanyRefay from "../Assets/Reciters/HanyRefay.webp";
import Husary from "../Assets/Reciters/Husary.webp";
import Ibrahim from "../Assets/Reciters/Ibrahim.webp";
import MaherMeaqly from "../Assets/Reciters/MaherMeaqly.webp";
import Mashary from "../Assets/Reciters/Mashary.webp";
import Menshawy from "../Assets/Reciters/Menshawy.webp";
import MuhammedGebril from "../Assets/Reciters/MuhammedGebril.webp";
import MuhammedIob from "../Assets/Reciters/MuhammedIob.webp";
import Shorem from "../Assets/Reciters/Shorem.webp";
import Sodes from "../Assets/Reciters/Sodes.webp";

import aboDawod from "../Assets/Books/aboDawod.webp"
import bukhari from "../Assets/Books/bukhari.webp"
import daremi from "../Assets/Books/daremi.webp"
import ibnMajah from "../Assets/Books/ibnMajah.webp"
import malik from "../Assets/Books/malik.webp"
import muslim from "../Assets/Books/muslim.webp"
import nasai from "../Assets/Books/nasai.webp"
import termezei from "../Assets/Books/termezei.webp"

import beads from "../Assets/Azkar/beads.webp"
import moon from "../Assets/Azkar/moon.webp"
import mosque from "../Assets/Azkar/mosque.webp"
import praying from "../Assets/Azkar/praying.webp"
import quran from "../Assets/Azkar/quran.webp"
import sleep from "../Assets/Azkar/sleep.webp"
import sunny from "../Assets/Azkar/sunny.webp"
import wakeUp from "../Assets/Azkar/wake-up.webp"

export const surahNames = [
    { number: 1, en: "Al-Fatiha", ar: "الفاتحة", ayahs: 7 },
    { number: 2, en: "Al-Baqarah", ar: "البقرة", ayahs: 286 },
    { number: 3, en: "Aal-E-Imran", ar: "آل عمران", ayahs: 200 },
    { number: 4, en: "An-Nisa", ar: "النساء", ayahs: 176 },
    { number: 5, en: "Al-Maidah", ar: "المائدة", ayahs: 120 },
    { number: 6, en: "Al-Anam", ar: "الأنعام", ayahs: 165 },
    { number: 7, en: "Al-Araf", ar: "الأعراف", ayahs: 206 },
    { number: 8, en: "Al-Anfal", ar: "الأنفال", ayahs: 75 },
    { number: 9, en: "At-Tawbah", ar: "التوبة", ayahs: 129 },
    { number: 10, en: "Yunus", ar: "يونس", ayahs: 109 },
    { number: 11, en: "Hud", ar: "هود", ayahs: 123 },
    { number: 12, en: "Yusuf", ar: "يوسف", ayahs: 111 },
    { number: 13, en: "Ar-Rad", ar: "الرعد", ayahs: 43 },
    { number: 14, en: "Ibrahim", ar: "إبراهيم", ayahs: 52 },
    { number: 15, en: "Al-Hijr", ar: "الحجر", ayahs: 99 },
    { number: 16, en: "An-Nahl", ar: "النحل", ayahs: 128 },
    { number: 17, en: "Al-Isra", ar: "الإسراء", ayahs: 111 },
    { number: 18, en: "Al-Kahf", ar: "الكهف", ayahs: 110 },
    { number: 19, en: "Maryam", ar: "مريم", ayahs: 98 },
    { number: 20, en: "Taha", ar: "طه", ayahs: 135 },
    { number: 21, en: "Al-Anbiya", ar: "الأنبياء", ayahs: 112 },
    { number: 22, en: "Al-Hajj", ar: "الحج", ayahs: 78 },
    { number: 23, en: "Al-Muminun", ar: "المؤمنون", ayahs: 118 },
    { number: 24, en: "An-Nur", ar: "النور", ayahs: 64 },
    { number: 25, en: "Al-Furqan", ar: "الفرقان", ayahs: 77 },
    { number: 26, en: "Ash-Shuara", ar: "الشعراء", ayahs: 227 },
    { number: 27, en: "An-Naml", ar: "النمل", ayahs: 93 },
    { number: 28, en: "Al-Qasas", ar: "القصص", ayahs: 88 },
    { number: 29, en: "Al-Ankabut", ar: "العنكبوت", ayahs: 69 },
    { number: 30, en: "Ar-Rum", ar: "الروم", ayahs: 60 },
    { number: 31, en: "Luqman", ar: "لقمان", ayahs: 34 },
    { number: 32, en: "As-Sajda", ar: "السجدة", ayahs: 30 },
    { number: 33, en: "Al-Ahzab", ar: "الأحزاب", ayahs: 73 },
    { number: 34, en: "Saba", ar: "سبأ", ayahs: 54 },
    { number: 35, en: "Fatir", ar: "فاطر", ayahs: 45 },
    { number: 36, en: "Yaseen", ar: "يس", ayahs: 83 },
    { number: 37, en: "As-Saffat", ar: "الصافات", ayahs: 182 },
    { number: 38, en: "Sad", ar: "ص", ayahs: 88 },
    { number: 39, en: "Az-Zumar", ar: "الزمر", ayahs: 75 },
    { number: 40, en: "Ghafir", ar: "غافر", ayahs: 85 },
    { number: 41, en: "Fussilat", ar: "فصلت", ayahs: 54 },
    { number: 42, en: "Ash-Shura", ar: "الشورى", ayahs: 53 },
    { number: 43, en: "Az-Zukhruf", ar: "الزخرف", ayahs: 89 },
    { number: 44, en: "Ad-Dukhan", ar: "الدخان", ayahs: 59 },
    { number: 45, en: "Al-Jathiya", ar: "الجاثية", ayahs: 37 },
    { number: 46, en: "Al-Ahqaf", ar: "الأحقاف", ayahs: 35 },
    { number: 47, en: "Muhammad", ar: "محمد", ayahs: 38 },
    { number: 48, en: "Al-Fath", ar: "الفتح", ayahs: 29 },
    { number: 49, en: "Al-Hujraat", ar: "الحجرات", ayahs: 18 },
    { number: 50, en: "Qaf", ar: "ق", ayahs: 45 },
    { number: 51, en: "Adh-Dhariyat", ar: "الذاريات", ayahs: 60 },
    { number: 52, en: "At-Tur", ar: "الطور", ayahs: 49 },
    { number: 53, en: "An-Najm", ar: "النجم", ayahs: 62 },
    { number: 54, en: "Al-Qamar", ar: "القمر", ayahs: 55 },
    { number: 55, en: "Ar-Rahman", ar: "الرحمن", ayahs: 78 },
    { number: 56, en: "Al-Waqia", ar: "الواقعة", ayahs: 96 },
    { number: 57, en: "Al-Hadid", ar: "الحديد", ayahs: 29 },
    { number: 58, en: "Al-Mujadila", ar: "المجادلة", ayahs: 22 },
    { number: 59, en: "Al-Hashr", ar: "الحشر", ayahs: 24 },
    { number: 60, en: "Al-Mumtahina", ar: "الممتحنة", ayahs: 13 },
    { number: 61, en: "As-Saff", ar: "الصف", ayahs: 14 },
    { number: 62, en: "Al-Jumua", ar: "الجمعة", ayahs: 11 },
    { number: 63, en: "Al-Munafiqun", ar: "المنافقون", ayahs: 11 },
    { number: 64, en: "At-Taghabun", ar: "التغابن", ayahs: 18 },
    { number: 65, en: "At-Talaq", ar: "الطلاق", ayahs: 12 },
    { number: 66, en: "At-Tahrim", ar: "التحريم", ayahs: 12 },
    { number: 67, en: "Al-Mulk", ar: "الملك", ayahs: 30 },
    { number: 68, en: "Al-Qalam", ar: "القلم", ayahs: 52 },
    { number: 69, en: "Al-Haaqqa", ar: "الحاقة", ayahs: 52 },
    { number: 70, en: "Al-Maarij", ar: "المعارج", ayahs: 44 },
    { number: 71, en: "Nuh", ar: "نوح", ayahs: 28 },
    { number: 72, en: "Al-Jinn", ar: "الجن", ayahs: 28 },
    { number: 73, en: "Al-Muzzammil", ar: "المزمل", ayahs: 20 },
    { number: 74, en: "Al-Muddathir", ar: "المدثر", ayahs: 56 },
    { number: 75, en: "Al-Qiyama", ar: "القيامة", ayahs: 40 },
    { number: 76, en: "Al-Insan", ar: "الإنسان", ayahs: 31 },
    { number: 77, en: "Al-Mursalat", ar: "المرسلات", ayahs: 50 },
    { number: 78, en: "An-Naba", ar: "النبأ", ayahs: 40 },
    { number: 79, en: "An-Naziat", ar: "النازعات", ayahs: 46 },
    { number: 80, en: "Abasa", ar: "عبس", ayahs: 42 },
    { number: 81, en: "At-Takwir", ar: "التكوير", ayahs: 29 },
    { number: 82, en: "Al-Infitar", ar: "الإنفطار", ayahs: 19 },
    { number: 83, en: "Al-Mutaffifin", ar: "المطففين", ayahs: 36 },
    { number: 84, en: "Al-Inshiqaq", ar: "الإنشقاق", ayahs: 25 },
    { number: 85, en: "Al-Buruj", ar: "البروج", ayahs: 22 },
    { number: 86, en: "At-Tariq", ar: "الطارق", ayahs: 17 },
    { number: 87, en: "Al-Ala", ar: "الأعلى", ayahs: 19 },
    { number: 88, en: "Al-Ghashiya", ar: "الغاشية", ayahs: 26 },
    { number: 89, en: "Al-Fajr", ar: "الفجر", ayahs: 30 },
    { number: 90, en: "Al-Balad", ar: "البلد", ayahs: 20 },
    { number: 91, en: "Ash-Shams", ar: "الشمس", ayahs: 15 },
    { number: 92, en: "Al-Lail", ar: "الليل", ayahs: 21 },
    { number: 93, en: "Ad-Duha", ar: "الضحى", ayahs: 11 },
    { number: 94, en: "Ash-Sharh", ar: "الشرح", ayahs: 8 },
    { number: 95, en: "At-Tin", ar: "التين", ayahs: 8 },
    { number: 96, en: "Al-Alaq", ar: "العلق", ayahs: 19 },
    { number: 97, en: "Al-Qadr", ar: "القدر", ayahs: 5 },
    { number: 98, en: "Al-Bayyina", ar: "البينة", ayahs: 8 },
    { number: 99, en: "Az-Zalzala", ar: "الزلزلة", ayahs: 8 },
    { number: 100, en: "Al-Adiyat", ar: "العاديات", ayahs: 11 },
    { number: 101, en: "Al-Qaria", ar: "القارعة", ayahs: 11 },
    { number: 102, en: "At-Takathur", ar: "التكاثر", ayahs: 8 },
    { number: 103, en: "Al-Asr", ar: "العصر", ayahs: 3 },
    { number: 104, en: "Al-Humaza", ar: "الهمزة", ayahs: 9 },
    { number: 105, en: "Al-Fil", ar: "الفيل", ayahs: 5 },
    { number: 106, en: "Quraish", ar: "قريش", ayahs: 4 },
    { number: 107, en: "Al-Maun", ar: "الماعون", ayahs: 7 },
    { number: 108, en: "Al-Kawthar", ar: "الكوثر", ayahs: 3 },
    { number: 109, en: "Al-Kafiroon", ar: "الكافرون", ayahs: 6 },
    { number: 110, en: "An-Nasr", ar: "النصر", ayahs: 3 },
    { number: 111, en: "Al-Masad", ar: "المسد", ayahs: 5 },
    { number: 112, en: "Al-Ikhlas", ar: "الإخلاص", ayahs: 4 },
    { number: 113, en: "Al-Falaq", ar: "الفلق", ayahs: 5 },
    { number: 114, en: "An-Nas", ar: "الناس", ayahs: 6 }
  ];


export const juzNames = [
  { number: 1, name: { en: "Juz' 1", ar: "الجزء 1" }, surahs: 2 },    
  { number: 2, name: { en: "Juz' 2", ar: "الجزء 2" }, surahs: 1 },    
  { number: 3, name: { en: "Juz' 3", ar: "الجزء 3" }, surahs: 2 },    
  { number: 4, name: { en: "Juz' 4", ar: "الجزء 4" }, surahs: 2 },    
  { number: 5, name: { en: "Juz' 5", ar: "الجزء 5" }, surahs: 2 },    
  { number: 6, name: { en: "Juz' 6", ar: "الجزء 6" }, surahs: 2 },    
  { number: 7, name: { en: "Juz' 7", ar: "الجزء 7" }, surahs: 2 },    
  { number: 8, name: { en: "Juz' 8", ar: "الجزء 8" }, surahs: 2 },    
  { number: 9, name: { en: "Juz' 9", ar: "الجزء 9" }, surahs: 2 },    
  { number: 10, name: { en: "Juz' 10", ar: "الجزء 10" }, surahs: 2 }, 
  { number: 11, name: { en: "Juz' 11", ar: "الجزء 11" }, surahs: 2 }, 
  { number: 12, name: { en: "Juz' 12", ar: "الجزء 12" }, surahs: 2 }, 
  { number: 13, name: { en: "Juz' 13", ar: "الجزء 13" }, surahs: 2 }, 
  { number: 14, name: { en: "Juz' 14", ar: "الجزء 14" }, surahs: 2 }, 
  { number: 15, name: { en: "Juz' 15", ar: "الجزء 15" }, surahs: 2 }, 
  { number: 16, name: { en: "Juz' 16", ar: "الجزء 16" }, surahs: 2 }, 
  { number: 17, name: { en: "Juz' 17", ar: "الجزء 17" }, surahs: 2 }, 
  { number: 18, name: { en: "Juz' 18", ar: "الجزء 18" }, surahs: 2 }, 
  { number: 19, name: { en: "Juz' 19", ar: "الجزء 19" }, surahs: 2 }, 
  { number: 20, name: { en: "Juz' 20", ar: "الجزء 20" }, surahs: 2 }, 
  { number: 21, name: { en: "Juz' 21", ar: "الجزء 21" }, surahs: 3 }, 
  { number: 22, name: { en: "Juz' 22", ar: "الجزء 22" }, surahs: 3 }, 
  { number: 23, name: { en: "Juz' 23", ar: "الجزء 23" }, surahs: 3 }, 
  { number: 24, name: { en: "Juz' 24", ar: "الجزء 24" }, surahs: 3 }, 
  { number: 25, name: { en: "Juz' 25", ar: "الجزء 25" }, surahs: 3 }, 
  { number: 26, name: { en: "Juz' 26", ar: "الجزء 26" }, surahs: 3 }, 
  { number: 27, name: { en: "Juz' 27", ar: "الجزء 27" }, surahs: 3 }, 
  { number: 28, name: { en: "Juz' 28", ar: "الجزء 28" }, surahs: 3 }, 
  { number: 29, name: { en: "Juz' 29", ar: "الجزء 29" }, surahs: 11 },
  { number: 30, name: { en: "Juz' 30", ar: "الجزء 30" }, surahs: 37 } 
];

export const reciters = [
  { id: "ar.abdullahbasfar", NameEn: "Abdullah Basfar", NameAr: "عبد الله بصفر", image: Besfer },
  { id: "ar.abdurrahmaansudais", NameEn: "Abdurrahman Al-Sudais", NameAr: "عبدالرحمن السديس", image: Sodes },
  { id: "ar.shaatree", NameEn: "Abu Bakr Ash-Shaatree", NameAr: "أبو بكر الشاطري", image: AboBakr },
  { id: "ar.ahmedajamy", NameEn: "Ahmed Al-Ajamy", NameAr: "أحمد العجمي", image: AhmedAgamy },
  { id: "ar.alafasy", NameEn: "Mishary Alafasy", NameAr: "مشاري العفاسي", image: Mashary },
  { id: "ar.hanirifai", NameEn: "Hani Rifai", NameAr: "هاني الرفاعي", image: HanyRefay },
  { id: "ar.husarymujawwad", NameEn: "Mahmoud Al-Husary (Mujawwad)", NameAr: "محمود الحصري (المجود)", image: Husary },
  { id: "ar.hudhaify", NameEn: "Ali Al-Hudhaify", NameAr: "علي الحذيفي", image: Ali },
  { id: "ar.ibrahimakhbar", NameEn: "Ibrahim Akhdar", NameAr: "إبراهيم الأخضر", image: Ibrahim },
  { id: "ar.mahermuaiqly", NameEn: "Maher Al Muaiqly", NameAr: "ماهر المعيقلي", image: MaherMeaqly },
  { id: "ar.muhammadayyoub", NameEn: "Muhammad Ayyoub", NameAr: "محمد أيوب", image: MuhammedIob },
  { id: "ar.muhammadjibreel", NameEn: "Muhammad Jibreel", NameAr: "محمد جبريل", image: MuhammedGebril },
  { id: "ar.saoodshuraym", NameEn: "Saood bin Ibraaheem Ash-Shuraym", NameAr: "سعود الشريم", image: Shorem },
  {id:"ar.minshawi", NameEn: "Mohamed El-Minshawi", NameAr: "محمد المنشاوي", image: Menshawy}
];

export const hadithBooks = [
  {
      id: 'muslim',
      name_en: 'Muslim',
      name_ar: 'مسلم',
      image: muslim,
      number: 800
  },
  {
      id: 'bukhari',
      name_en: 'Bukhari',
      name_ar: 'البخاري',
      image: bukhari,
      number: 590
  },
  {
      id: 'tirmidzi',
      name_en: 'Tirmidhi',
      name_ar: 'الترمذي',
      image: termezei,
      number: 770     
  },
  {
      id: 'nasai',
      name_en: 'Nasai',
      name_ar: 'النسائي',
      image: nasai,
      number: 800
  },
  {
      id: 'abu-daud',
      name_en: 'Abu Daud',
      name_ar: 'أبو داود',
      image: aboDawod,
      number: 780
  },
  {
      id: 'ibnu-majah',
      name_en: 'Ibnu Majah',
      name_ar: 'ابن ماجه',
      image: ibnMajah,
      number: 800
  },
  {
      id: 'darimi',
      name_en: 'Darimi',
      name_ar: 'الدارمي',
      image: daremi,
      number: 660
  },
  {
      id: 'malik',
      name_en: 'Malik',
      name_ar: 'مالك',
      image: malik,
      number: 300
  }
];

export const AzkarCategories = [
    { id: 'morning_azkar', ar: 'أذكار الصباح', en: 'Morning Azkar', number: 25, image: sunny },
    { id: 'evening_azkar', ar: 'أذكار المساء', en: 'Evening Azkar', number: 25, image: moon },
    { id: 'post_salah_azkar', ar: 'أذكار بعد السلام من الصلاة المفروضة', en: 'Post-Salah Azkar', number: 9, image: praying },
    { id: 'tasbeeh', ar: 'تسابيح', en: 'Tasbeeh', number: 16, image: beads },
    { id: 'sleep_azkar', ar: 'أذكار النوم', en: 'Sleep Azkar', number: 10, image: sleep },
    { id: 'wake_up_azkar', ar: 'أذكار الاستيقاظ', en: 'Wake Up Azkar', number: 3, image: wakeUp },
    { id: 'quranic_duas', ar: 'أدعية قرآنية', en: 'Quranic Duas', number: 26, image: quran },
    { id: 'prophets_duas', ar: 'أدعية الأنبياء', en: 'Prophets\' Duas', number: 13, image: mosque }
  ];

export const duas = [
  "اللَّهُمَّ، اغْفِرْ له وَارْحَمْهُ، وَاعْفُ عنْه وَعَافِهِ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بمَاءٍ وَثَلْجٍ وَبَرَدٍ، وَنَقِّهِ مِنَ الخَطَايَا كما يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِن دَارِهِ، وَأَهْلًا خَيْرًا مِن أَهْلِهِ، وَزَوْجًا خَيْرًا مِن زَوْجِهِ، وَقِهِ فِتْنَةَ القَبْرِ وَعَذَابَ النَّارِ",
  "اللهم أنت رب هذه الروح، وأنت خلقتها، وأنت هديتها للإسلام، وأنت قبضت روحها، وأنت أعلم بسرها وعلانيتها، جئنا شفعاء فاغفر له",
  "اللهمّ أبدله دارًا خيرًا من داره، وأهلًا خيرًا من أهله، وأدخله الجنّة، وأعذه من عذاب القبر، ومن عذاب النّار. اللهمّ عامله بما أنت أهله، ولا تعامله بما هو أهله",
  "اللهمّ اجزه عن الإحسان إحسانًا، وعن الإساءة عفوًا وغفرانًا، اللهمّ إن كان محسنًا فزد من حسناته، وإن كان مسيئًا فتجاوز عن سيّئاته، اللهمّ أدخله الجنّة من غير مناقشة حساب، ولا سابقة عذاب، اللهمّ آنسه في وحدته، وفي وحشته، وفي غربته",
  "اللهمّ أنزله منزلًا مباركًا، وأنت خير المنزلين، اللهمّ أنزله منازل الصدّيقين، والشّهداء، والصّالحين، وحسُن أولئك رفيقًا، اللهمّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار، اللهمّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة",
  "اللهمّ أعذه من عذاب القبر، وجفاف ِالأرض عن جنبيها. اللهمّ املأ قبره بالرّضا، والنّور، والفسحة، والسّرور، اللهمّ إنّه في ذمّتك وحبل جوارك، فقِهِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه، إنّك أنت الغفور الرّحيم",
  "اللهمّ إنّه عبدك وابن عبدك، خرج من الدّنيا، وسعتها، ومحبوبها، وأحبّائه فيها، إلى ظلمة القبر، وما هو لاقيه، اللهمّ إنّه كان يشهد أنّك لا إله إلّا أنت، وأنّ محمّدًا عبدك ورسولك، وأنت أعلم به",
  "اللهمّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السّؤال، اللهمّ إنّه نَزَل بك وأنت خير منزولٍ به، وأصبح فقيرًا إلى رحمتك، وأنت غنيٌّ عن عذابه، اللهمّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين",
  "اللهمّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات، بجوار حبيبك ومصطفاك صلّى الله عليه وسلّم، اللهمّ أمّنه من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسه آمنةً مطمئنّةً، ولقّنه حجّته. اللهمّ اجعله في بطن القبر مطمئنًّا، وعند قيام الأشهاد آمنًا، وبجود رضوانك واثقًا، وإلى أعلى درجاتك سابقًا",
  "اللهم اجعل عن يمينه نورًا، حتّى تبعثه آمنًا مطمئنًّا في نورٍ من نورك، اللهمّ انظر إليه نظرة رضا، فإنّ من تنظُر إليه نظرة رضًا لا تعذّبه أبدًا، اللهمّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم"
];

export const DiedSurahs = [
    {
      name: { ar: "الفاتحة", en: "Al-Fatihah" },
      content: `
        بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ (1) الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (2) الرَّحْمَٰنِ الرَّحِيمِ (3) مَالِكِ يَوْمِ الدِّينِ (4) إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ (5) اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ (6) صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ (7)
      `,
    },
    {
      name: { ar: "البقرة - اوائل الايات", en: "Al-Baqarah (Opening Verses)" },
      content: `
        الم (1) ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِلْمُتَّقِينَ (2) الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ (3) وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ (4) أُو۟لَٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ (5)
      `,
    },
    {
      name: { ar: "البقرة - الخاتمة", en: "Al-Baqarah (Closing Verses)" },
      content: `
        لِّلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِن تُبْدُوا مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللَّهُ ۖ فَيَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ (284) آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ (285) لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ (286)
      `,
    },
    {
      name: { ar: "الإخلاص", en: "Al-Ikhlas" },
      content: `
        قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ (4)
      `,
    },
    {
      name: {ar: "يس" , en: "Yaseen"},
      content: `
      يسٓ (1) وَٱلۡقُرۡءَانِ ٱلۡحَكِيمِ (2) إِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ (3) عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ (4) تَنزِيلَ ٱلۡعَزِيزِ ٱلرَّحِيمِ (5) لِتُنذِرَ قَوۡمٗا مَّآ أُنذِرَ ءَابَآؤُهُمۡ فَهُمۡ غَٰفِلُونَ (6) لَقَدۡ حَقَّ ٱلۡقَوۡلُ عَلَىٰٓ أَكۡثَرِهِمۡ فَهُمۡ لَا يُؤۡمِنُونَ (7) إِنَّا جَعَلۡنَا فِيٓ أَعۡنَٰقِهِمۡ أَغۡلَٰلٗا فَهِيَ إِلَى ٱلۡأَذۡقَانِ فَهُم مُّقۡمَحُونَ (8) وَجَعَلۡنَا مِنۢ بَيۡنِ أَيۡدِيهِمۡ سَدّٗا وَمِنۡ خَلۡفِهِمۡ سَدّٗا فَأَغۡشَيۡنَٰهُمۡ فَهُمۡ لَا يُبۡصِرُونَ (9) وَسَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ لَا يُؤۡمِنُونَ (10) إِنَّمَا تُنذِرُ مَنِ ٱتَّبَعَ ٱلذِّكۡرَ وَخَشِيَ ٱلرَّحۡمَٰنَ بِٱلۡغَيۡبِۖ فَبَشِّرۡهُ بِمَغۡفِرَةٖ وَأَجۡرٖ كَرِيمٍ (11) إِنَّا نَحۡنُ نُحۡيِ ٱلۡمَوۡتَىٰ وَنَكۡتُبُ مَا قَدَّمُواْ وَءَاثَٰرَهُمۡۚ وَكُلَّ شَيۡءٍ أَحۡصَيۡنَٰهُ فِيٓ إِمَامٖ مُّبِينٖ (12) وَٱضۡرِبۡ لَهُم مَّثَلًا أَصۡحَٰبَ ٱلۡقَرۡيَةِ إِذۡ جَآءَهَا ٱلۡمُرۡسَلُونَ (13) إِذۡ أَرۡسَلۡنَآ إِلَيۡهِمُ ٱثۡنَيۡنِ فَكَذَّبُوهُمَا فَعَزَّزۡنَا بِثَالِثٖ فَقَالُوٓاْ إِنَّآ إِلَيۡكُم مُّرۡسَلُونَ (14) قَالُواْ مَآ أَنتُمۡ إِلَّا بَشَرٞ مِّثۡلُنَا وَمَآ أَنزَلَ ٱلرَّحۡمَٰنُ مِن شَيۡءٍ إِنۡ أَنتُمۡ إِلَّا تَكۡذِبُونَ (15) قَالُواْ رَبُّنَا يَعۡلَمُ إِنَّآ إِلَيۡكُمۡ لَمُرۡسَلُونَ (16) وَمَا عَلَيۡنَآ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ (17) قَالُوٓاْ إِنَّا تَطَيَّرۡنَا بِكُمۡۖ لَئِن لَّمۡ تَنتَهُواْ لَنَرۡجُمَنَّكُمۡ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٞ (18) قَالُواْ طَٰٓئِرُكُم مَّعَكُمۡ أَئِن ذُكِّرۡتُمۚ بَلۡ أَنتُمۡ قَوۡمٞ مُّسۡرِفُونَ (19) وَجَآءَ مِنۡ أَقۡصَا ٱلۡمَدِينَةِ رَجُلٞ يَسۡعَىٰ قَالَ يَٰقَوۡمِ ٱتَّبِعُواْ ٱلۡمُرۡسَلِينَ (20) ٱتَّبِعُواْ مَن لَّا يَسۡـَٔلُكُمۡ أَجۡرٗا وَهُم مُّهۡتَدُونَ (21) وَمَا لِيَ لَآ أَعۡبُدُ ٱلَّذِي فَطَرَنِي وَإِلَيۡهِ تُرۡجَعُونَ (22) ءَأَتَّخِذُ مِن دُونِهِۦٓ ءَالِهَةً إِن يُرِدۡنِ ٱلرَّحۡمَٰنُ بِضُرّٖ لَّا تُغۡنِ عَنِّي شَفَٰعَتُهُمۡ شَيۡـٔٗا وَلَا يُنقِذُونِ (23) إِنِّيٓ إِذٗا لَّفِي ضَلَٰلٖ مُّبِينٍ (24) إِنِّيٓ ءَامَنتُ بِرَبِّكُمۡ فَٱسۡمَعُونِ (25) قِيلَ ٱدۡخُلِ ٱلۡجَنَّةَۖ قَالَ يَٰلَيۡتَ قَوۡمِي يَعۡلَمُونَ (26) بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ ٱلۡمُكۡرَمِينَ (27) ۞وَمَآ أَنزَلۡنَا عَلَىٰ قَوۡمِهِۦ مِنۢ بَعۡدِهِۦ مِن جُندٖ مِّنَ ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ (28) إِن كَانَتۡ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ فَإِذَا هُمۡ خَٰمِدُونَ (29) يَٰحَسۡرَةً عَلَى ٱلۡعِبَادِۚ مَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ (30) أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّنَ ٱلۡقُرُونِ أَنَّهُمۡ إِلَيۡهِمۡ لَا يَرۡجِعُونَ (31) وَإِن كُلّٞ لَّمَّا جَمِيعٞ لَّدَيۡنَا مُحۡضَرُونَ (32) وَءَايَةٞ لَّهُمُ ٱلۡأَرۡضُ ٱلۡمَيۡتَةُ أَحۡيَيۡنَٰهَا وَأَخۡرَجۡنَا مِنۡهَا حَبّٗا فَمِنۡهُ يَأۡكُلُونَ (33) وَجَعَلۡنَا فِيهَا جَنَّٰتٖ مِّن نَّخِيلٖ وَأَعۡنَٰبٖ وَفَجَّرۡنَا فِيهَا مِنَ ٱلۡعُيُونِ (34) لِيَأۡكُلُواْ مِن ثَمَرِهِۦ وَمَا عَمِلَتۡهُ أَيۡدِيهِمۡۚ أَفَلَا يَشۡكُرُونَ (35) سُبۡحَٰنَ ٱلَّذِي خَلَقَ ٱلۡأَزۡوَٰجَ كُلَّهَا مِمَّا تُنۢبِتُ ٱلۡأَرۡضُ وَمِنۡ أَنفُسِهِمۡ وَمِمَّا لَا يَعۡلَمُونَ (36) وَءَايَةٞ لَّهُمُ ٱلَّيۡلُ نَسۡلَخُ مِنۡهُ ٱلنَّهَارَ فَإِذَا هُم مُّظۡلِمُونَ (37) وَٱلشَّمۡسُ تَجۡرِي لِمُسۡتَقَرّٖ لَّهَاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ (38) وَٱلۡقَمَرَ قَدَّرۡنَٰهُ مَنَازِلَ حَتَّىٰ عَادَ كَٱلۡعُرۡجُونِ ٱلۡقَدِيمِ (39) لَا ٱلشَّمۡسُ يَنۢبَغِي لَهَآ أَن تُدۡرِكَ ٱلۡقَمَرَ وَلَا ٱلَّيۡلُ سَابِقُ ٱلنَّهَارِۚ وَكُلّٞ فِي فَلَكٖ يَسۡبَحُونَ (40) وَءَايَةٞ لَّهُمۡ أَنَّا حَمَلۡنَا ذُرِّيَّتَهُمۡ فِي ٱلۡفُلۡكِ ٱلۡمَشۡحُونِ (41) وَخَلَقۡنَا لَهُم مِّن مِّثۡلِهِۦ مَا يَرۡكَبُونَ (42) وَإِن نَّشَأۡ نُغۡرِقۡهُمۡ فَلَا صَرِيخَ لَهُمۡ وَلَا هُمۡ يُنقَذُونَ (43) إِلَّا رَحۡمَةٗ مِّنَّا وَمَتَٰعًا إِلَىٰ حِينٖ (44) وَإِذَا قِيلَ لَهُمُ ٱتَّقُواْ مَا بَيۡنَ أَيۡدِيكُمۡ وَمَا خَلۡفَكُمۡ لَعَلَّكُمۡ تُرۡحَمُونَ (45) وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ (46) وَإِذَا قِيلَ لَهُمۡ أَنفِقُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَنُطۡعِمُ مَن لَّوۡ يَشَآءُ ٱللَّهُ أَطۡعَمَهُۥٓ إِنۡ أَنتُمۡ إِلَّا فِي ضَلَٰلٖ مُّبِينٖ (47) وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ (48) مَا يَنظُرُونَ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ تَأۡخُذُهُمۡ وَهُمۡ يَخِصِّمُونَ (49) فَلَا يَسۡتَطِيعُونَ تَوۡصِيَةٗ وَلَآ إِلَىٰٓ أَهۡلِهِمۡ يَرۡجِعُونَ (50) وَنُفِخَ فِي ٱلصُّورِ فَإِذَا هُم مِّنَ ٱلۡأَجۡدَاثِ إِلَىٰ رَبِّهِمۡ يَنسِلُونَ (51) قَالُواْ يَٰوَيۡلَنَا مَنۢ بَعَثَنَا مِن مَّرۡقَدِنَاۜۗ هَٰذَا مَا وَعَدَ ٱلرَّحۡمَٰنُ وَصَدَقَ ٱلۡمُرۡسَلُونَ (52) إِن كَانَتۡ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ فَإِذَا هُمۡ جَمِيعٞ لَّدَيۡنَا مُحۡضَرُونَ (53) فَٱلۡيَوۡمَ لَا تُظۡلَمُ نَفۡسٞ شَيۡـٔٗا وَلَا تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ (54) إِنَّ أَصۡحَٰبَ ٱلۡجَنَّةِ ٱلۡيَوۡمَ فِي شُغُلٖ فَٰكِهُونَ (55) هُمۡ وَأَزۡوَٰجُهُمۡ فِي ظِلَٰلٍ عَلَى ٱلۡأَرَآئِكِ مُتَّكِـُٔونَ (56) لَهُمۡ فِيهَا فَٰكِهَةٞ وَلَهُم مَّا يَدَّعُونَ (57) سَلَٰمٞ قَوۡلٗا مِّن رَّبّٖ رَّحِيمٖ (58) وَٱمۡتَٰزُواْ ٱلۡيَوۡمَ أَيُّهَا ٱلۡمُجۡرِمُونَ (59) ۞أَلَمۡ أَعۡهَدۡ إِلَيۡكُمۡ يَٰبَنِيٓ ءَادَمَ أَن لَّا تَعۡبُدُواْ ٱلشَّيۡطَٰنَۖ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ (60) وَأَنِ ٱعۡبُدُونِيۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ (61) وَلَقَدۡ أَضَلَّ مِنكُمۡ جِبِلّٗا كَثِيرًاۖ أَفَلَمۡ تَكُونُواْ تَعۡقِلُونَ (62) هَٰذِهِۦ جَهَنَّمُ ٱلَّتِي كُنتُمۡ تُوعَدُونَ (63) ٱصۡلَوۡهَا ٱلۡيَوۡمَ بِمَا كُنتُمۡ تَكۡفُرُونَ (64) ٱلۡيَوۡمَ نَخۡتِمُ عَلَىٰٓ أَفۡوَٰهِهِمۡ وَتُكَلِّمُنَآ أَيۡدِيهِمۡ وَتَشۡهَدُ أَرۡجُلُهُم بِمَا كَانُواْ يَكۡسِبُونَ (65) وَلَوۡ نَشَآءُ لَطَمَسۡنَا عَلَىٰٓ أَعۡيُنِهِمۡ فَٱسۡتَبَقُواْ ٱلصِّرَٰطَ فَأَنَّىٰ يُبۡصِرُونَ (66) وَلَوۡ نَشَآءُ لَمَسَخۡنَٰهُمۡ عَلَىٰ مَكَانَتِهِمۡ فَمَا ٱسۡتَطَٰعُواْ مُضِيّٗا وَلَا يَرۡجِعُونَ (67) وَمَن نُّعَمِّرۡهُ نُنَكِّسۡهُ فِي ٱلۡخَلۡقِۚ أَفَلَا يَعۡقِلُونَ (68) وَمَا عَلَّمۡنَٰهُ ٱلشِّعۡرَ وَمَا يَنۢبَغِي لَهُۥٓۚ إِنۡ هُوَ إِلَّا ذِكۡرٞ وَقُرۡءَانٞ مُّبِينٞ (69) لِّيُنذِرَ مَن كَانَ حَيّٗا وَيَحِقَّ ٱلۡقَوۡلُ عَلَى ٱلۡكَٰفِرِينَ (70) أَوَلَمۡ يَرَوۡاْ أَنَّا خَلَقۡنَا لَهُم مِّمَّا عَمِلَتۡ أَيۡدِينَآ أَنۡعَٰمٗا فَهُمۡ لَهَا مَٰلِكُونَ (71) وَذَلَّلۡنَٰهَا لَهُمۡ فَمِنۡهَا رَكُوبُهُمۡ وَمِنۡهَا يَأۡكُلُونَ (72) وَلَهُمۡ فِيهَا مَنَٰفِعُ وَمَشَارِبُۚ أَفَلَا يَشۡكُرُونَ (73) وَٱتَّخَذُواْ مِن دُونِ ٱللَّهِ ءَالِهَةٗ لَّعَلَّهُمۡ يُنصَرُونَ (74) لَا يَسۡتَطِيعُونَ نَصۡرَهُمۡ وَهُمۡ لَهُمۡ جُندٞ مُّحۡضَرُونَ (75) فَلَا يَحۡزُنكَ قَوۡلُهُمۡۘ إِنَّا نَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَ (76) أَوَلَمۡ يَرَ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن نُّطۡفَةٖ فَإِذَا هُوَ خَصِيمٞ مُّبِينٞ (77) وَضَرَبَ لَنَا مَثَلٗا وَنَسِيَ خَلۡقَهُۥۖ قَالَ مَن يُحۡيِ ٱلۡعِظَٰمَ وَهِيَ رَمِيمٞ (78) قُلۡ يُحۡيِيهَا ٱلَّذِيٓ أَنشَأَهَآ أَوَّلَ مَرَّةٖۖ وَهُوَ بِكُلِّ خَلۡقٍ عَلِيمٌ (79) ٱلَّذِي جَعَلَ لَكُم مِّنَ ٱلشَّجَرِ ٱلۡأَخۡضَرِ نَارٗا فَإِذَآ أَنتُم مِّنۡهُ تُوقِدُونَ (80) أَوَلَيۡسَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِقَٰدِرٍ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۚ بَلَىٰ وَهُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ (81) إِنَّمَآ أَمۡرُهُۥٓ إِذَآ أَرَادَ شَيۡـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ (82) فَسُبۡحَٰنَ ٱلَّذِي بِيَدِهِۦ مَلَكُوتُ كُلِّ شَيۡءٖ وَإِلَيۡهِ تُرۡجَعُونَ (83)
      `
    }
]