export const duas = [
  "اللَّهُمَّ، اغْفِرْ له وَارْحَمْهُ، وَاعْفُ عنْه وَعَافِهِ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بمَاءٍ وَثَلْجٍ وَبَرَدٍ، وَنَقِّهِ مِنَ الخَطَايَا كما يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِن دَارِهِ، وَأَهْلًا خَيْرًا مِن أَهْلِهِ، وَزَوْجًا خَيْرًا مِن زَوْجِهِ، وَقِهِ فِتْنَةَ القَبْرِ وَعَذَابَ النَّارِ",
  "اللهم أنت رب هذه الروح، وأنت خلقتها، وأنت هديتها للإسلام، وأنت قبضت روحها، وأنت أعلم بسرها وعلانيتها، جئنا شفعاء فاغفر له",
  "اللهمّ أبدله دارًا خيرًا من داره، وأهلًا خيرًا من أهله، وأدخله الجنّة، وأعذه من عذاب القبر، ومن عذاب النّار. اللهمّ عامله بما أنت أهله، ولا تعامله بما هو أهله",
  "اللهمّ اجزه عن الإحسان إحسانًا، وعن الإساءة عفوًا وغفرانًا، اللهمّ إن كان محسنًا فزد من حسناته، وإن كان مسيئًا فتجاوز عن سيّئاته، اللهمّ أدخله الجنّة من غير مناقشة حساب، ولا سابقة عذاب، اللهمّ آنسه في وحدته، وفي وحشته، وفي غربته",
  "اللهمّ أنزله منزلًا مباركًا، وأنت خير المنزلين، اللهمّ أنزله منازل الصدّيقين، والشّهداء، والصّالحين، وحسُن أولئك رفيقًا، اللهمّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار، اللهمّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة",
  "اللهمّ أعذه من عذاب القبر، وجفاف ِالأرض عن جنبيها. اللهمّ املأ قبره بالرّضا، والنّور، والفسحة، والسّرور، اللهمّ إنّه في ذمّتك وحبل جوارك، فقِهِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه، إنّك أنت الغفور الرّحيم",
  "اللهمّ إنّه عبدك وابن عبدك، خرج من الدّنيا، وسعتها، ومحبوبها، وأحبّائه فيها، إلى ظلمة القبر، وما هو لاقيه، اللهمّ إنّه كان يشهد أنّك لا إله إلّا أنت، وأنّ محمّدًا عبدك ورسولك، وأنت أعلم به",
  "اللهمّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السّؤال، اللهمّ إنّه نَزَل بك وأنت خير منزولٍ به، وأصبح فقيرًا إلى رحمتك، وأنت غنيٌّ عن عذابه، اللهمّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين",
  "اللهمّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات، بجوار حبيبك ومصطفاك صلّى الله عليه وسلّم، اللهمّ أمّنه من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسه آمنةً مطمئنّةً، ولقّنه حجّته. اللهمّ اجعله في بطن القبر مطمئنًّا، وعند قيام الأشهاد آمنًا، وبجود رضوانك واثقًا، وإلى أعلى درجاتك سابقًا",
  "اللهم اجعل عن يمينه نورًا، حتّى تبعثه آمنًا مطمئنًّا في نورٍ من نورك، اللهمّ انظر إليه نظرة رضا، فإنّ من تنظُر إليه نظرة رضًا لا تعذّبه أبدًا، اللهمّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم",
];

export const DiedSurahs = [
  {
    name: { ar: "الفاتحة", en: "Al-Fatihah" },
  },
  {
    name: { ar: "البقرة - اوائل الايات", en: "Al-Baqarah (Opening Verses)" },
  },
  {
    name: { ar: "البقرة - الخاتمة", en: "Al-Baqarah (Closing Verses)" },
  },
  {
    name: { ar: "الإخلاص", en: "Al-Ikhlas" },
  },
  {
    name: { ar: "يس", en: "Yaseen" },
  },
];
